"""
Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих.
Начиная с 1 и 2, первые 10 элементов будут:
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи,
которые не превышают четыре миллиона.
"""


def even_fibonacci_numbers(limit_number: int):
    """Функция находит cумму четных элементов ряда Фибоначчи не превышающих limit_number"""
    a = 0
    b = 1
    result = 0

    for _ in range(limit_number):
        # Если сумма чисел меньше лимита - выполняем код
        if result < limit_number:
            # Последовательность Фибоначчи
            sum_number = a + b
            a = b
            b = sum_number

            # Суммируем четные элементы Фибоначчи
            if sum_number % 2 == 0:
                result += sum_number

        # Если сумма выше лимита - показываем результат
        else:
            return result


if __name__ == "__main__":
    print(even_fibonacci_numbers(4_000_000))